zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_nand.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_nand.h
  * @author  MCD Application Team
  * @brief   Header file of NAND HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_HAL_NAND_H
#define STM32MP13xx_HAL_NAND_H

#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_ll_fmc.h"

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @addtogroup NAND
  * @{
  */

/* Exported typedef ----------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/** @defgroup NAND_Exported_Types NAND Exported Types
  * @{
  */

/**
  * @brief  HAL NAND State enum definition
  */
typedef enum
{
  HAL_NAND_STATE_RESET     = 0x00U,  /*!< NAND not yet initialized or disabled */
  HAL_NAND_STATE_READY     = 0x01U,  /*!< NAND initialized and ready for use   */
  HAL_NAND_STATE_BUSY      = 0x02U,  /*!< NAND internal process is ongoing     */
  HAL_NAND_STATE_ERROR     = 0x03U   /*!< NAND error state                     */
} HAL_NAND_StateTypeDef;

/**
  * @brief  HAL NAND Error name definition
  */
typedef enum
{
  HAL_NAND_ERROR_NONE      = 0x00U,  /*!< No error                             */
  HAL_NAND_ERROR_TIMEOUT   = 0x01U,  /*!< Timeout error                        */
  HAL_NAND_ERROR_NO_XFER   = 0x02U,  /*!< Abort requested with no Xfer ongoing */
  HAL_NAND_ERROR_DMA       = 0x04U,  /*!< Error when initializing DMA          */
  HAL_NAND_ERROR_BUSY      = 0x08U   /*!< Busy error                           */
} HAL_NAND_ErrorTypeDef;

/**
  * @brief  NAND Memory electronic signature Structure definition
  */
typedef struct
{
  /*<! NAND memory electronic signature maker and device IDs */

  uint8_t Maker_Id;

  uint8_t Device_Id;

  uint8_t Third_Id;

  uint8_t Fourth_Id;
} NAND_IDTypeDef;

/**
  * @brief  NAND Memory address Structure definition
  */
typedef struct
{
  uint16_t Page;   /*!< NAND memory Page address  */

  uint16_t Plane;   /*!< NAND memory Zone address  */

  uint16_t Block;  /*!< NAND memory Block address */

} NAND_AddressTypeDef;

/**
  * @brief  NAND Memory info Structure definition
  */
typedef struct
{
  uint32_t        PageSize;              /*!< NAND memory page (without spare area) size measured in bytes
                                              for 8 bits addressing or words for 16 bits addressing             */

  uint32_t        SpareAreaSize;         /*!< NAND memory spare area size measured in bytes
                                              for 8 bits addressing or words for 16 bits addressing             */

  uint32_t        BlockSize;             /*!< NAND memory block size measured in number of pages               */

  uint32_t        BlockNbr;              /*!< NAND memory number of total blocks                               */

  uint32_t        PlaneNbr;              /*!< NAND memory number of planes                                     */

  uint32_t        PlaneSize;             /*!< NAND memory zone size measured in number of blocks               */

  FunctionalState ExtraCommandEnable;    /*!< NAND extra command needed for Page reading mode. This
                                              parameter is mandatory for some NAND parts after the read
                                              command (NAND_CMD_AREA_TRUE1) and before DATA reading sequence.
                                              This parameter could be ENABLE or DISABLE
                                              Please check the Read Mode sequence in the NAND device datasheet */
} NAND_DeviceConfigTypeDef;

/**
  * @brief  NAND ECC configuration
  */
typedef struct
{
  uint8_t         Offset;         /*!< Offset of the ECC from the beginning of the spare area  measured in
                                       bytes for 8 bits addressing or words for 16 bits addressing */
} NAND_EccConfigTypeDef;

/**
  * @brief  NAND ECC statistics
  */
typedef struct
{
  uint16_t        CorrectibleErrorTotal;    /*!< Total number of correctible errors found during the last page read */
  uint8_t         CorrectibleErrorMax;      /*!< Maximum number of correctible errors found in a single sector during the last page read */
  uint8_t         CorrectibleSectorCount;   /*!< Number of sector with at least one correctible error found during the last page read */
  uint8_t         BadSectorCount;           /*!< Number of sector with too many errors found during the last page read */
} NAND_EccStatisticsTypeDef;

/**
  * @brief  NAND ECC state
  */
typedef struct
{
  uint16_t        SectorSize;               /*!< Sector size for ECC measured in
                                                 bytes for 8 bits addressing or words for 16 bits addressing */
  uint8_t         SectorCount;              /*!< Number of sectors in a page */

  uint8_t         EccLength;                /*!< Length of ECC in bits for a sector */
  uint8_t         EccSize;                  /*!< Size of ECC in bytes for a sector */
} NAND_EccStateTypeDef;

#ifdef HAL_MDMA_MODULE_ENABLED

/**
  * @brief  NAND sequencer configuration
  */
typedef struct
{
  MDMA_HandleTypeDef *HdmaRead;
  MDMA_HandleTypeDef *HdmaWrite;
  MDMA_HandleTypeDef *HdmaReadEcc;
  uint32_t          *EccBuffer;
} NAND_SequencerConfigTypeDef;

/**
  * @brief  NAND sequencer state
  */
typedef struct
{
  uint16_t EccBufferSize;
  bool TransferPending;
  bool WriteFlag;
  bool RawFlag;
  void *Data;
} NAND_SequencerStateTypeDef;

#endif /* HAL_MDMA_MODULE_ENABLED  */

/**
  * @brief  NAND handle Structure definition
  */
#if (USE_HAL_NAND_REGISTER_CALLBACKS == 1)
typedef struct __NAND_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_NAND_REGISTER_CALLBACKS  */
{
  FMC_NAND_TypeDef         *Instance;  /*!< Register base address                                 */

  FMC_NAND_InitTypeDef     Init;       /*!< NAND device control configuration parameters          */

  HAL_LockTypeDef            Lock;              /*!< NAND locking object                                   */

