zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_nand.h
HAL_StatusTypeDef  HAL_NAND_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, uint16_t *pBuffer,
                                          uint32_t NumPagesToRead);
HAL_StatusTypeDef  HAL_NAND_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, uint16_t *pBuffer,
                                           uint32_t NumPagesToWrite);
HAL_StatusTypeDef  HAL_NAND_Read_SinglePage_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                uint16_t *pBuffer, uint32_t Offset, uint32_t Length);
HAL_StatusTypeDef  HAL_NAND_Write_SinglePage_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                 uint16_t *pBuffer, uint32_t Offset, uint32_t Length);
HAL_StatusTypeDef  HAL_NAND_Read_SpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                               uint16_t *pBuffer, uint32_t NumSpareAreasToRead);
HAL_StatusTypeDef  HAL_NAND_Write_SpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                uint16_t *pBuffer, uint32_t NumSpareAreasTowrite);
HAL_StatusTypeDef  HAL_NAND_Read_SingleSpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                     uint16_t *pBuffer, uint32_t Offset, uint32_t Length);
HAL_StatusTypeDef  HAL_NAND_Write_SingleSpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                      uint16_t *pBuffer, uint32_t Offset, uint32_t Length);

HAL_StatusTypeDef  HAL_NAND_Erase_Block(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress);

uint32_t           HAL_NAND_Address_Inc(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress);

#if (USE_HAL_NAND_REGISTER_CALLBACKS == 1)
/* NAND callback registering/unregistering */
HAL_StatusTypeDef  HAL_NAND_RegisterCallback(NAND_HandleTypeDef *hnand, HAL_NAND_CallbackIDTypeDef CallbackId,
                                             pNAND_CallbackTypeDef pCallback);
HAL_StatusTypeDef  HAL_NAND_UnRegisterCallback(NAND_HandleTypeDef *hnand, HAL_NAND_CallbackIDTypeDef CallbackId);
#endif /* USE_HAL_NAND_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup NAND_Exported_Functions_Group3 Peripheral Control functions
  * @{
  */

/* NAND Control functions  ****************************************************/
HAL_StatusTypeDef  HAL_NAND_ECC_Enable(NAND_HandleTypeDef *hnand);
HAL_StatusTypeDef  HAL_NAND_ECC_Disable(NAND_HandleTypeDef *hnand);
HAL_StatusTypeDef  HAL_NAND_GetECC(NAND_HandleTypeDef *hnand, uint32_t *ECCval, uint32_t Timeout);
HAL_StatusTypeDef  HAL_NAND_ECC_SetAlgorithm(NAND_HandleTypeDef *hnand, uint32_t Algorithm);
HAL_StatusTypeDef  HAL_NAND_ECC_SetBCHMode(NAND_HandleTypeDef *hnand, uint32_t Mode);
HAL_StatusTypeDef  HAL_NAND_ECC_SetAccessMode(NAND_HandleTypeDef *Device, uint32_t Mode);
HAL_StatusTypeDef  HAL_NAND_ECC_GetBCH(NAND_HandleTypeDef *hnand, uint32_t *ECCval, uint32_t Timeout);
HAL_StatusTypeDef  HAL_NAND_ECC_GetErrorsBCH(NAND_HandleTypeDef *hnand, uint16_t *Positions, int32_t *ErrorCount,
                                             uint32_t Timeout);

/**
  * @}
  */

/** @addtogroup NAND_Exported_Functions_Group4 Peripheral State functions
  * @{
  */
/* NAND State functions *******************************************************/
HAL_NAND_StateTypeDef HAL_NAND_GetState(NAND_HandleTypeDef *hnand);
HAL_StatusTypeDef     HAL_NAND_Read_Status(NAND_HandleTypeDef *hnand, uint32_t *NandStatus);
/**
  * @}
  */

/** @addtogroup NAND_Exported_Functions_Group5 Input and Output functions with error correction
  * @{
  */

HAL_StatusTypeDef  HAL_NAND_ECC_Init(NAND_HandleTypeDef *hnand, const NAND_EccConfigTypeDef *Config);
HAL_StatusTypeDef  HAL_NAND_ECC_DeInit(NAND_HandleTypeDef *hnand);

HAL_StatusTypeDef  HAL_NAND_ECC_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                             uint8_t *pBuffer, uint32_t NumPagesToRead, uint32_t *NumPagesRead);
HAL_StatusTypeDef  HAL_NAND_ECC_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint8_t *pBuffer, uint32_t NumPagesToWrite, uint32_t *NumPagesWritten);

HAL_StatusTypeDef  HAL_NAND_ECC_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint16_t *pBuffer, uint32_t NumPagesToRead, uint32_t *NumPagesRead);
HAL_StatusTypeDef  HAL_NAND_ECC_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                               uint16_t *pBuffer, uint32_t NumPagesToWrite, uint32_t *NumPagesWritten);

void               HAL_NAND_ECC_GetStatistics(NAND_HandleTypeDef *hnand, NAND_EccStatisticsTypeDef *Stat);

/**
  * @}
  */

/** @addtogroup NAND_Exported_Functions_Group6 Functions with error correction
  * @{
  */

#ifdef HAL_MDMA_MODULE_ENABLED

uint32_t           HAL_NAND_Sequencer_GetEccWordsPerSector(NAND_HandleTypeDef *hnand);
uint32_t           HAL_NAND_Sequencer_ComputeEccBufferSize(NAND_HandleTypeDef *hnand);

HAL_StatusTypeDef  HAL_NAND_Sequencer_Init(NAND_HandleTypeDef *hnand, const NAND_SequencerConfigTypeDef *Config);
HAL_StatusTypeDef  HAL_NAND_Sequencer_DeInit(NAND_HandleTypeDef *hnand);

HAL_StatusTypeDef  HAL_NAND_Sequencer_MspInit(NAND_HandleTypeDef *hnand);
void               HAL_NAND_Sequencer_MspDeInit(NAND_HandleTypeDef *hnand);

HAL_StatusTypeDef  HAL_NAND_Sequencer_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                   uint8_t *pBuffer);
HAL_StatusTypeDef  HAL_NAND_Sequencer_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                    uint8_t *pBuffer);

HAL_StatusTypeDef  HAL_NAND_Sequencer_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                    uint16_t *pBuffer);
HAL_StatusTypeDef  HAL_NAND_Sequencer_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                     uint16_t *pBuffer);

HAL_StatusTypeDef  HAL_NAND_Sequencer_ECC_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                       uint8_t *pBuffer);
HAL_StatusTypeDef  HAL_NAND_Sequencer_ECC_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                        uint8_t *pBuffer);

HAL_StatusTypeDef  HAL_NAND_Sequencer_ECC_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                        uint16_t *pBuffer);
HAL_StatusTypeDef  HAL_NAND_Sequencer_ECC_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                         uint16_t *pBuffer);

HAL_StatusTypeDef HAL_NAND_Sequencer_Abort(NAND_HandleTypeDef *hnand);

HAL_StatusTypeDef HAL_NAND_Sequencer_WaitCompletion(NAND_HandleTypeDef *hnand, uint32_t TimeOut);

#endif /* HAL_MDMA_MODULE_ENABLED  */

/**
  * @}
  */


/**
  * @}
  */

