zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_nand.h
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup NAND_Private_Constants NAND Private Constants
  * @{
  */
#define NAND_DEVICE                0x80000000UL

#define NAND_RESET_TIMEOUT         0x20UL
#define NAND_READ_BEGIN_TIMEOUT    0x20UL
#define NAND_WRITE_END_TIMEOUT     0x20UL
#define NAND_ERASE_BLOCK_TIMEOUT   0x20UL


#define NAND_DATA_OFFSET          (0UL<<16U)
#define NAND_CMD_OFFSET           (1UL<<16U)  /* A16 = CLE high */
#define NAND_ADDR_OFFSET          (2UL<<16U)  /* A17 = ALE high */

#define NAND_MEM_OFFSET           (0UL<<27U)
#define NAND_ATT_OFFSET           (1UL<<27U)

#define NAND_NCE1_OFFSET          (0x0UL<<24U)
#define NAND_NCE2_OFFSET          (0x1UL<<24U)


#define NAND_CMD_AREA_A            0x00U
#define NAND_CMD_AREA_B            0x01U
#define NAND_CMD_AREA_C            0x50U
#define NAND_CMD_AREA_TRUE1        0x30U
#define NAND_CMD_RANDOM_OUTPUT_0   0x05U
#define NAND_CMD_RANDOM_OUTPUT_1   0xE0U

#define NAND_CMD_WRITE0            0x80U
#define NAND_CMD_WRITE_TRUE1       0x10U
#define NAND_CMD_RANDOM_INPUT      0x85U

#define NAND_CMD_ERASE0            0x60U
#define NAND_CMD_ERASE1            0xD0U
#define NAND_CMD_READID            0x90U
#define NAND_CMD_STATUS            0x70U
#define NAND_CMD_LOCK_STATUS       0x7AU
#define NAND_CMD_RESET             0xFFU

/* NAND memory status */
#define NAND_VALID_ADDRESS         0x00000100UL
#define NAND_INVALID_ADDRESS       0x00000200UL
#define NAND_TIMEOUT_ERROR         0x00000400UL
#define NAND_BUSY                  0x00000000UL
#define NAND_ERROR                 0x00000001UL
#define NAND_READY                 0x00000040UL
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup NAND_Private_Macros NAND Private Macros
  * @{
  */

/**
  * @brief  NAND memory address computation.
  * @param  __ADDRESS__ NAND memory address.
  * @param  __HANDLE__  NAND handle.
  * @retval NAND Raw address value
  */
#define ARRAY_ADDRESS(__ADDRESS__ , __HANDLE__) ((__ADDRESS__)->Page + \
                                                 (((__ADDRESS__)->Block + \
                                                   (((__ADDRESS__)->Plane) * \
                                                    ((__HANDLE__)->Config.PlaneSize)))* \
                                                  ((__HANDLE__)->Config.BlockSize)))

/**
  * @brief  NAND memory spare area column address computation.
  * @param  __HANDLE__ NAND handle.
  * @retval NAND Raw address value
  */
#define SPARE_AREA_COLUMN_ADDRESS( __HANDLE__) ((__HANDLE__)->Config.PageSize)

/**
  * @brief  NAND memory address cycling.
  * @param  __ADDRESS__ NAND memory address.
  * @retval NAND address cycling value.
  */
#define ADDR_1ST_CYCLE(__ADDRESS__)       (uint8_t)(__ADDRESS__)              /* 1st addressing cycle */
#define ADDR_2ND_CYCLE(__ADDRESS__)       (uint8_t)((__ADDRESS__) >> 8)       /* 2nd addressing cycle */
#define ADDR_3RD_CYCLE(__ADDRESS__)       (uint8_t)((__ADDRESS__) >> 16)      /* 3rd addressing cycle */
#define ADDR_4TH_CYCLE(__ADDRESS__)       (uint8_t)((__ADDRESS__) >> 24)      /* 4th addressing cycle */

/**
  * @brief  NAND memory Columns cycling.
  * @param  __ADDRESS__ NAND memory address.
  * @retval NAND Column address cycling value.
  */
#define COLUMN_1ST_CYCLE(__ADDRESS__)       (uint8_t)((__ADDRESS__) & 0xFFU)    /* 1st Column addressing cycle */
#define COLUMN_2ND_CYCLE(__ADDRESS__)       (uint8_t)((__ADDRESS__) >> 8)       /* 2nd Column addressing cycle */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif

#endif /* STM32MP13xx_HAL_NAND_H */

